In [10]:
import sys

import numpy as np
import pandas as pd
import s3fs

sys.path.append("/Users/fgu/dev/projects/mdb_eval")
import src.helpers.io as io
import src.helpers.data as hd
import src.data.aggregators as agg
import src.data.selectors as sl

fs = s3fs.S3FileSystem(profile="3di")

pd.set_option("display.max_rows", 120)
pd.set_option("display.max_columns", 120)
pd.set_option("max_colwidth", None)
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [2]:
fs.ls('s3://3di-data-mdb/clean')

['3di-data-mdb/clean/',
 '3di-data-mdb/clean/mdb_000.parquet',
 '3di-data-mdb/clean/mdb_111.parquet',
 '3di-data-mdb/clean/mdb_777.parquet',
 '3di-data-mdb/clean/mdb_X11.parquet',
 '3di-data-mdb/clean/mdb_X77.parquet',
 '3di-data-mdb/clean/mdb_costa.parquet',
 '3di-data-mdb/clean/pieces',
 '3di-data-mdb/clean/samples']

In [44]:
df = io.read_parquet('s3://3di-project-eval/eval_111.parquet')
hd.inspect(df)

shape: (0, 23), users: 0

Empty DataFrame
Columns: [user_id, ym, ymn, txns_count, txns_volume, month_income, inflows, outflows, netflows, netflows_norm, inflows_norm, outflows_norm, has_pos_netflows, pos_netflows_norm, t, month_spend, pct_credit, age, is_female, region_name, is_urban, has_sa_account, generation]
Index: []

False

## txn data dev

In [12]:
dfm = io.read_parquet('s3://3di-data-mdb/clean/mdb_111.parquet')

In [53]:
k = agg.has_sa_account(dfm).to_frame().reset_index()
k

Time for has_sa_account                : 0.04 seconds

      user_id       ym  has_sa_account
0         111  2012-01            True
1         111  2012-02            True
2         111  2012-03            True
3         111  2012-04            True
4         111  2012-05            True
...       ...      ...             ...
7298   589111  2020-03            True
7299   589111  2020-04            True
7300   589111  2020-05            True
7301   589111  2020-06            True
7302   589111  2020-07            True

[7303 rows x 3 columns]

In [58]:
sl.savings_account(k)

Time for savings_account               : 0.00 seconds

      user_id       ym  has_sa_account
0         111  2012-01            True
1         111  2012-02            True
2         111  2012-03            True
3         111  2012-04            True
4         111  2012-05            True
...       ...      ...             ...
7298   589111  2020-03            True
7299   589111  2020-04            True
7300   589111  2020-05            True
7301   589111  2020-06            True
7302   589111  2020-07            True

[4708 rows x 3 columns]

In [ ]:
kk